{"id":51,"cpu":"64-bit 93,75 MHz NEC VR4300","graphics":"62,5 MHz SGI RCP","media":"Nintendo 64 Game Pak","memory":"4 MB RDRAM","name":"Initial version","online":"RANDnetDD (Japan Only)","output":"Composite video and S-Video","platform_logo":259,"platform_version_release_dates":[36,37,39,133],"resolutions":"256x224, 320x240 and 640x480","slug":"initial-version-4369dd46-1ced-49c7-85f2-7f5c28d72be5","sound":"16-bit, stereo, CD quality","storage":"64 MB Cartridge and 256 Kb Controller Pak","summary":"In the early 1990s there was a trend by video game companies to update their 16-bit cartridge-based systems to 32-bit CD-ROM based systems. Nintendo aimed extensive research at a possible CD-ROM add-on for its Super NES console. They launched development projects with, ironically, Sony and Philips but were not impressed with the loading speed of the CD-ROM-based systems. Nintendo instead opted to explore the potential of combining the fastest data storage device available: the silicon-based game cartridge, with the fastest computer chip to be used in video games: the 64-bit processor.\n\nChairman of Nintendo of America, Howard Lincoln, teamed with Jim Clark, Chairman of Silicon Graphics, the company that had done the special effects for Terminator 2: Judgment Day and Jurassic Park. They sought to design a new game system capable of incredible graphics-rendering power. The new system was initially called, \"Project Reality.\" The term \"Project Reality\" was in reference to the \"real\" three-dimensional environments that they knew could be created with the new system. The new platform would run on the powerful 100 MHz MIPS RISC microprocessor. Foreseeing the finite future of the current television standard, Nintendo made sure that \"Project Reality\" would also be compatible with HDTV (high-definition television).\n\nOn July 18, 1994, Nintendo revealed that the new name for their system, the \"Ultra 64\" (later changed to Nintendo 64), would use 500MHz DRAM memory technology from Rambus, Inc. This fast access speed would provide the means for extremely fluid three-dimensional graphics.\n\nNintendo announced that it would release the Nintendo 64 system to American consumers on April 21, 1996. The price would be under $250. This date was soon pushed back five months in order to allow manufacturers enough time to produce enough systems to accommodate the projected consumer demand.\n\nWhen the Nintendo 64 system was finally launched on September 29, 1996, only two games were available to American consumers: Super Mario 64 and Pilot wings 64. In a move considered risky by Nintendo, no game cartridge was packaged with the Nintendo 64 system. Only the console, a single gray controller and an AC adapter were included in the original packaging. The Nintendo 64 debuted with a retail price of $199.\n\nThe Nintendo 64 system and the game Super Mario 64 opened to rave reviews from the critics. Next Generation magazine even called Super Mario 64, \"the greatest video game ever made.\"\n\nOn its first day of sale, the Nintendo 64 system sold 500,000 units in North America. It took the PlayStation three months to sell the same amount. By the end of March 1997, Nintendo had sold over 3.3 million units of its new system.\n\nBesides the obvious innovations in graphics, the Nintendo 64 featured a unique controller with fourteen buttons and an analog joystick at the center. The joystick provides complete 360° control of on-screen action. On the bottom of the controller is a quick-action \"Z-trigger\" and a multi-directional control pad. Additional controllers (in designer colors) are available for $25 each.\n\nPlayers can attach an optional Controller Pak to the memory cart slot on the back of the Nintendo 64 controller. It stores a player's game statistics, preferred controller button configuration and built-up character strengths.\n\nNintendo introduced the Rumble Pak accessory in June 1997 along with the Star Fox 64 game cartridge. It attaches to the rear of the controller and vibrates according to various actions that occur on the screen (such as explosions or gunshots). The Rumble Pak is powered by two AAA batteries that can last up to 60 hours of play. Its retail price is $19.95.\n\nNintendo of America's President Minoru Arakawa announced a storage attachment for the system called the Nintendo 64 Disk Drive (64DD) in 1997. Also known as the \"bulky\" drive for its large or \"bulk\" storage capacity, the 64DD is designed to be a \"writable\" drive. Players would be able to customize existing games by introducing new characters or additional levels. This storage unit would sit beneath the Nintendo 64 console and plug into the \"EXT.\" expansion connector on the bottom of the system. The magnetic disk would be capable of holding 64 megabytes. It would be about the same size of a 3.5-inch floppy disk and twice as thick. When it is inserted into the 64DD, the disk would add four megabytes to the main memory, thereby upgrading the system's total to eight megabytes. Nintendo had originally announced that the first game to use this technology would be The Legend of Zelda: Ocarina of Time. While the 64DD was originally announced to be available in 1997, Nintendo cancelled its plans to debut the system upgrade in the United States.\n\nNintendo announced the release of the Nintendo 64 Expansion Pak on November 23, 1998. The Expansion Pak is a four-megabyte RAM cartridge that fits underneath a removable panel located on the top of the console. It will also increase the total RAM memory on the system to eight megabytes and allow select Nintendo 64 games to be played in a special high-resolution mode. The retail price for the Expansion Pak was $29.95. The first Expansion Pak compatible games to be announced were Star Wars: Rogue Squadron, NFL Quarterback Club 99 and Turok 2: Seeds of Evil.","url":"https://www.igdb.com/platforms/n64/version/initial-version-4369dd46-1ced-49c7-85f2-7f5c28d72be5"}